Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Retrieves the GuiControl object of the GUI's focused control.
ja: GUI のフォーカスされているコントロールのGuiControl オブジェクトを取得します。

source: Retrieves the Menu or MenuBar object corresponding to a Win32 menu handle.
ja: Win32 メニューハンドルに対応するMenu または MenuBar オブジェクトを取得します。

source: Retrieves the ClassNN of the control.
ja: コントロールの ClassNN を取得します。

source: Retrieves the ClassNN of the currently focused control.
ja: 現在フォーカスされているコントロールの ClassNN を取得します。

source: Retrieves the Gui object by using the HWND of the GUI window just created and reports its title.
ja: 作成したGUIウィンドウのHWNDを使用してGuiオブジェクトを取得し、そのタイトルを報告します。

source: Retrieves the HWND of the control.
ja: コントロールの HWND を取得します。

source: Retrieves the TYPE of a registry value (e.g. REG_SZ or REG_DWORD).
ja: レジストリ値のTYPEを取得します（例：REG_SZ、REG_DWORD）。

source: Retrieves the active tab number of the first Tab control.
ja: 最初のタブコントロールのアクティブなタブ番号を取得します。

source: Retrieves the buffer's current memory address.
ja: バッファの現在のメモリアドレスを取得します。

source: Retrieves the color of the pixel at the specified X and Y coordinates.
ja: 指定した座標のピクセルの色を取得します。 <分節 21706 ¶>

source: Retrieves the color of the pixel at the specified x,y coordinates.
ja: 指定されたx,y座標にある画素の色を取得します。

source: Retrieves the contents of a file.
ja: ファイルの内容を取得します。

source: Retrieves the contents of the specified registry subkey, one item at a time.
ja: 指定されたレジストリサブキーの内容を一度に1項目ずつ取得します。

source: Retrieves the control's GUI parent.
ja: コントロールの GUI 親を取得します。

source: Retrieves the count of how many characters are in a string.
ja: 文字列の中に何文字あるかを取得します。

source: Retrieves the creation time and stores it in Timestamp.
ja: 作成時刻を取得し、Timestampに格納します。

source: Retrieves the current focus state of the control.
ja: コントロールの現在のフォーカス状態を取得します。

source: Retrieves the current interaction state of the control, or enables or disables (grays out) it.
ja: コントロールの現在のインタラクションの状態を取得し、有効または無効（グレイアウト）にします。

source: Retrieves the current position of the caret (text insertion point).
ja: キャレット（テキスト挿入点）の現在位置を取得します。

source: Retrieves the current position of the mouse cursor, and optionally which window and control it is hovering over.
ja: マウスカーソルの現在位置を取得します。また、オプションでどのウィンドウとコントロール上にカーソルがあるのかを取得します。

source: Retrieves the current state of the first joystick's second button.
ja: 第1ジョイスティックの第2ボタンの現在の状態を取得します。

source: Retrieves the current state of the right mouse button.
ja: マウスの右ボタンの現在の状態を取得します。

source: Retrieves the current text from Notepad's edit control and stores it in Text.
ja: メモ帳のエディットコントロールから現在のテキストを取得し、Textに格納します。

source: Retrieves the current toggle state of CapsLock.
ja: CapsLockの現在のトグル状態を取得します。

source: Retrieves the current visibility state of the control, or shows or hides it.
ja: コントロールの現在の表示状態を取得し、表示または非表示にします。

source: Retrieves the datetime stamp of a file or folder.
ja: ファイルやフォルダのタイムスタンプ（日付）を取得します。

source: Retrieves the degree of transparency of the window under the mouse cursor.
ja: マウスカーソルの下にあるウィンドウの透明度を取得します。

source: Retrieves the extension of a file.
ja: ファイルの拡張子を取得します。

source: Retrieves the first line of the Notepad's Edit control.
ja: メモ帳の編集コントロールの1行目を取得します。

source: Retrieves the focus state of the control.
ja: コントロールのフォーカス状態を取得します。

source: Retrieves the implementation function of a method.
ja: メソッドの実装関数を取得します。

source: Retrieves the last line from a text file.
ja: テキストファイルから最終行を取得する。

source: Retrieves the lines in a text file, one at a time.
ja: テキストファイルの行を1行ずつ取得します。

source: Retrieves the menu's Win32 handle.
ja: メニューのWin32ハンドルを取得します。

source: Retrieves the modification time and stores it in Timestamp.
ja: 修正時刻を取得し、Timestampに格納します。

source: Retrieves the name of a sound device or component.
ja: サウンドデバイスやコンポーネントの名前を取得します。

source: Retrieves the name or text of a key.
ja: キーの名前またはテキストを取得します。

source: Retrieves the name/text of a key.
ja: キーの名前またはテキストを取得します。

source: Retrieves the next item or items in an enumeration.
ja: 列挙された項目のうち、次の項目を取得します。

source: Retrieves the number of key-value pairs present in a map.
ja: マップに存在するキーとバリューのペアの数を取得します。

source: Retrieves the number of mouse buttons and stores it in MouseButtonCount.
ja: マウスボタンの数を取得し、MouseButtonCountに格納します。

source: Retrieves the path of the desktop's current wallpaper.
ja: デスクトップの現在の壁紙のパスを取得します。

source: Retrieves the position and size of a control.
ja: コントロールの位置と大きさを取得します。

source: Retrieves the position and size of the control.
ja: コントロールの位置と大きさを取得します。

source: Retrieves the position and size of the specified window's client area.
ja: 指定されたウィンドウのクライアント領域の位置と大きさを取得します。

source: Retrieves the position and size of the specified window.
ja: 指定されたウィンドウの位置とサイズを取得します。

source: Retrieves the position and size of the window's client area.
ja: ウィンドウのクライアントエリアの位置とサイズを取得します。

source: Retrieves the position and size of the window.
ja: ウィンドウの位置と大きさを取得します。

source: Retrieves the scan code of a key.
ja: キーのスキャンコードを取得します。

source: Retrieves the size in bytes and stores it in Size.
ja: サイズをバイト単位で取得し、Sizeに格納します。

source: Retrieves the size in kilobytes and stores it in Size.
ja: サイズをキロバイト単位で取得し、Sizeに格納します。

source: Retrieves the size of a file.
ja: ファイルサイズを取得します。

source: Retrieves the specified files or folders, one at a time.
ja: 指定したファイルやフォルダを1つずつ取得します。

source: Retrieves the specified window's class name.
ja: 指定されたウィンドウのクラス名を取得します。

source: Retrieves the text at the specified row and column number.
ja: 指定された行番号と列番号のテキストを取得する。

source: Retrieves the text at the specified row and column.
ja: 指定された行と列のテキストを取得する。

source: Retrieves the text from a standard status bar control.
ja: 標準のステータスバーコントロールからテキストを取得します。

source: Retrieves the text from the specified window.
ja: 指定されたウィンドウからテキストを取得します。

source: Retrieves the text/name of the specified item.
ja: 指定された項目のテキスト/名前を取得します。

source: Retrieves the title of the specified window.
ja: 指定されたウィンドウのタイトルを取得します。

source: Retrieves the transparency of a window under the mouse cursor.
ja: マウスカーソルの下にあるウィンドウの透明度を取得します。

source: Retrieves the transparent color of a window under the mouse cursor.
ja: マウスカーソル下のウィンドウの透明色を取得します。

source: Retrieves the type of the control.
ja: コントロールの種類を取得します。

source: Retrieves the unique ID number of the Notepad's Edit control.
ja: メモ帳の編集コントロールの固有ID番号を取得します。

source: Retrieves the value of an environment variable and stores it in LogonServer.
ja: 環境変数を取得してLogonServerに保持します。

source: Retrieves the value of the specified environment variable.
ja: 指定された環境変数を取得します。

source: Retrieves the value or pointer stored in a COM wrapper object.
ja: COM ラッパーオブジェクトに格納されている値またはポインタを取得します。

source: Retrieves the value's base object.
ja: 値のベースとなるオブジェクトを取得します。

source: Retrieves the version of a file and stores it in Version.
ja: ファイルのバージョンを取得し、Versionに格納します。

source: Retrieves the version of a file.
ja: ファイルのバージョンを取得します。

source: Retrieves the version of the file "AutoHotkey.exe" located in AutoHotkey's installation directory and stores it in Version.
ja: AutoHotkeyのインストールディレクトリにあるファイル「AutoHotkey.exe」のバージョンを取得し、「Version」に格納します。

source: Retrieves the virtual key code of a key.
ja: 鍵の仮想鍵コードを取得します。

source: Retrieves the width and height of the virtual screen and stores them in VirtualScreenWidth and VirtualScreenHeight.
ja: 仮想スクリーンの幅と高さを取得し、VirtualScreenWidthとVirtualScreenHeightに格納する。

source: Retrieves the window handle (HWND) of the GUI window.
ja: GUIウィンドウのウィンドウハンドル（HWND）を取得します。

source: Retrieves the window handle (HWND) of the control.
ja: コントロールのウィンドウハンドル(HWND)を取得します。

source: Retrieves the window handle (HWND) of the window.
ja: GUIウィンドウのウィンドウハンドル（HWND）を取得します。

source: Retrieves type information from a COM object.
ja: COM オブジェクトから型情報を取得します。

source: Retrieves which control of the target window has keyboard focus, if any.
ja: ターゲットウィンドウのどのコントロールにキーボードフォーカスがあるのかを取得します（もしあれば）。

source: Retry, Cancel
ja: 再試行(R)、キャンセル

source: Return - Syntax & Usage | AutoHotkey v2
ja: Return - 構文と使用法｜AutoHotkey v2

source: Return Value
ja: 戻り値

source: Return a value
ja: 値を返す

source: Return the new object.
ja: 新しいオブジェクトを返す。

source: Return the value associated with Key, if found.
ja: Keyに関連する値が見つかれば、その値を返す。

source: Return the value at Index, if there is one (see Has).
ja: Indexに値がある場合、その値を返す（Has参照）。

source: Return the value of ArrayObj.Default, if defined.
ja: ArrayObj.Defaultが定義されていれば、その値を返す。

source: Return the value of MapObj.Default, if defined.
ja: MapObj.Defaultが定義されている場合、その値を返します。

source: Return the value of the Default parameter, if specified.
ja: Defaultパラメータが指定されている場合は、その値を返します。

source: Return, Exit, and General Remarks
ja: 復帰・退出・総評

source: Return, Exit, or ExitApp.
ja: Return、Exit、またはExitApp。

source: Return: Returning -1 will continue the thread, while 0 and 1 act as before.
ja: Return：-1を返すとスレッドを継続し、0と1は以前のように動作します。

source: Returning -1 will continue the thread, while 0 and 1 act as before.
ja: -1を返すとスレッドを継続し、0と1は以前のように動作します。

source: Returning Values to Caller
ja: 呼び出し元への値の返送

source: Returning non-zero stops further processing but still exits the thread.
ja: ゼロ以外を返すと、それ以降の処理は停止するが、スレッドは終了します。

source: Returning non-zero stops further processing but the script is still terminated.
ja: ゼロ以外を返すと、それ以降の処理は停止するが、スクリプトは終了します。

source: Returning structs larger than this (by value) is not supported.
ja: これより大きな構造体を（値で）返すことはサポートされていません。

source: Returns 1 (true) if an object owns a property by the specified name.
ja: オブジェクトが指定された名前のプロパティを所有している場合、1（true）を返します。

source: Returns 1 (true) if the function is built-in, otherwise 0 (false).
ja: 関数が組み込みのときに1（真）を返し、そうでんかれば0（偽）を返します。

source: Returns e (which is approximately 2.71828182845905) raised to the Nth power.
ja: e（約2.71828182845905）をN乗した値を返します。

source: Returns true if the function is built-in and false otherwise.
ja: 関数が内蔵されている場合はtrue、そうでない場合はfalseを返します。

source: Returns true if the function is variadic and false otherwise.
ja: 関数がvariadicであればtrueを、そうでなければfalseを返します。

source: Returns a Menu object which can be used to modify or display the tray menu.
ja: トレイメニューを変更または表示するために使用できるMenu オブジェクトを返します。

source: Returns a boolean value indicating whether the parameter is ByRef.
ja: パラメータが ByRef であるかどうかを示す boolean 値を返す。

source: Returns a boolean value indicating whether the parameter is optional.
ja: パラメータがオプションであるか否かを示すブール値を返します。

source: Returns a copy of the array.
ja: 配列のコピーを返します。

source: Returns a descriptor for a given own property, compatible with DefineProp.
ja: DefinePropと互換性のある、与えられた自身のプロパティの記述子を返します。

source: Returns a handle to a Win32 menu (a handle of type HMENU), constructing it if necessary.
ja: Win32メニューのハンドル（HMENU型ハンドル）を、必要に応じて構築して返します。

source: Returns a line of text, excluding the line ending.
ja: 行末を除いたテキストを返します。

source: Returns a list of items/rows from a ListView.
ja: ListViewから項目/行のリストを返します。

source: Returns a new enumerator.
ja: 新しい列挙者を返します。

source: Returns a non-zero integer if successful or zero if there were no items remaining.
ja: 成功した場合は0以外の整数を、アイテムが残っていない場合は0を返します。

source: Returns a non-zero number if the specified label exists in the current scope.
ja: 指定されたラベルが現在のスコープに存在する場合、0以外の数値を返します。

source: Returns a non-zero number if the specified value has a method by the specified name.
ja: 指定された値に指定された名前のメソッドがある場合、0 以外の数値を返します。

source: Returns a non-zero number if the specified value has a property by the specified name.
ja: 指定された値が指定された名前のプロパティを持つ場合、0 以外の数値を返します。

source: Returns a non-zero number if the specified value is an object.
ja: 指定された値がオブジェクトである場合、0以外の数値を返します。

source: Returns a non-zero number if the specified value is derived from the specified base object.
ja: 指定された値が指定されたベースオブジェクトから派生したものである場合、0 以外の数値を返します。

source: Returns a non-zero number if the specified variable has been assigned a value.
ja: 指定された変数に値が割り当てられている場合、0以外の数値を返します。

source: Returns a non-zero number if the specified window is maximized or minimized.
ja: 指定されたウィンドウが最大化または最小化されているときに、それぞれ1と-1を返します。

source: Returns a non-zero value (item ID) if the specified item has the specified attribute.
ja: 指定されたアイテムが指定された属性を持つ場合、0 以外の値（アイテム ID）を返します。

source: Returns a non-zero value if successful, otherwise zero.
ja: 成功した場合は0以外の値を、そうでない場合は0を返します。

source: Returns a non-zero value if the checkbox or radio button is checked.
ja: チェックボックスまたはラジオボタンがチェックされている場合、0以外の値を返します。

source: Returns a non-zero value if the specified control is enabled.
ja: 指定されたコントロールが有効のときに0 以外の値を返します。

source: Returns a non-zero value if the specified control is visible.
ja: 指定されたコントロールが可視状態であるときに0 以外の値を返します。

source: Returns a number if the read was successful, otherwise an empty string.
ja: 読み込みに成功した場合は数値を、そうでない場合は空の文字列を返します。

source: Returns a number rounded down to the nearest integer.
ja: 最も近い整数に切り捨てた数値を返します。

source: Returns a number rounded to N decimal places.
ja: 小数点以下N桁で四捨五入した数値を返します。

source: Returns a number rounded up to the nearest integer.
ja: 最も近い整数に切り上げられた数値を返します。

source: Returns a reference to an object provided by a COM component.
ja: COM コンポーネントが提供するオブジェクトへの参照を返します。

source: Returns a shallow copy of a map.
ja: マップの浅いコピーを返します。

source: Returns a shallow copy of an array.
ja: 配列のシャローコピーを返します。

source: Returns a shallow copy of an object.
ja: オブジェクトのシャローコピーを返す。

source: Returns a string of letters, one character for each drive letter in the system.
ja: システム内の各ドライブレターに対して1文字ずつ、文字列を返します。

source: Returns a string of the modifiers which were logically down when Input was terminated.
ja: Input終了時に論理的にダウンしていたモディファイアの文字列を返します。

source: Returns a string.
ja: 文字列を返します。

source: Returns a system file handle, intended for use with DllCall.
ja: DllCallで使用することを目的としたシステムファイルハンドルを返します。

source: Returns a wrapper object containing a variant type and value or pointer.
ja: バリアントタイプと値またはポインタを含むラッパーオブジェクトを返します。

source: Returns a wrapper object containing the variant type VT_DISPATCH and the given pointer.
ja: バリアントタイプのVT_DISPATCHと与えられたポインタを含むラッパーオブジェクトを返します。

source: Returns an EndReason string indicating how Input was terminated.
ja: Input がどのように終了したかを示すEndReason の文字列を返す。

source: Returns an array of items/rows from a ListBox, ComboBox, or DropDownList.
ja: ListBox、ComboBox、DropDownList の項目/行の配列を返します。

source: Returns an array of names (ClassNNs) for all controls in the specified window.
ja: 指定されたウィンドウ内のすべてのコントロールの名前（ClassNN）の配列を返します。

source: Returns an array of the system's IPv4 addresses.
ja: システムの IPv4 アドレスの配列を返します。

source: Returns an array of unique ID numbers (HWNDs) for all controls in the specified window.
ja: 指定したウィンドウ内のすべてのコントロールのID（HWND）の配列を返します。

source: Returns an array of unique ID numbers (HWNDs) for all existing windows that match the specified criteria.
ja: 指定された条件に合致する全てのウィンドウのID番号（HWND）の配列を返します。。

source: Returns an empty string if EndReason is not "Match".
ja: EndReasonが "Match"でない場合は、空文字列を返します。

source: Returns an empty string if the Input is still in progress.
ja: 入力がまだ進行中の場合は空文字列を返します。

source: Returns an integer representing the style or extended style of the specified control.
ja: 指定されたコントロールのスタイルまたは拡張スタイルを表す整数を返します。

source: Returns any text collected since the last time Input was started.
ja: 前回Inputを起動してから収集したテキストを返します。

source: Returns e raised to the Nth power.
ja: eをN乗した値を返します。

source: Returns from a subroutine to which execution had previously jumped via function-call, Hotkey activation, or other means.
ja: 関数呼び出しやホットキー操作などでジャンプしたサブルーチンから復帰します。

source: Returns if the calculator does not exist.
ja: 電卓が存在しない場合に返します。

source: Returns numbers from the Fibonacci sequence, indefinitely or until stopped.
ja: フィボナッチ数列から、無期限または停止するまで数値を返します。

source: Returns the MatchList item which caused the Input to terminate.
ja: マッチリスト入力終了の原因となった項目を返します。

source: Returns the NAME of the last encountered (*MARK:NAME), when applicable.
ja: 最後に出会った(*MARK:NAME)のNAMEを、該当する場合に返します。

source: Returns the ClassNN (class name and sequence number) of the specified control.
ja: 指定されたコントロールの ClassNN（クラス名とシーケンス番号）を返します。

source: Returns the ID number of the next item below the specified item (or 0 if none).
ja: 指定された項目の次の項目の ID 番号を返します（何もない場合は 0）。

source: Returns the ID number of the next item below the specified item.
ja: 指定された項目の次の項目の ID 番号を返します。

source: Returns the ID number of the sibling above the specified item (or 0 if none).
ja: 指定された項目の上にある兄弟の ID 番号を返します（ない場合は 0）。

source: Returns the ID number of the sibling above the specified item.
ja: 指定された項目の上にある兄弟の ID 番号を返します。

source: Returns the ID number of the specified item's first/top child (or 0 if none).
ja: 指定された項目の先頭/末尾の子の ID 番号を返します（ない場合は 0）。

source: Returns the ID number of the specified item's first/top child.
ja: 指定された項目の先頭/末尾の子の ID 番号を返します。

source: Returns the Process ID number (PID) of the specified window.
ja: 指定されたウィンドウのプロセスIDを返します。

source: Returns the Process ID number of the specified window.
ja: 指定されたウィンドウのプロセスID番号を返します。

source: Returns the absolute value of a number.
ja: 数値の絶対値を返します。

source: Returns the absolute value of the specified number.
ja: 指定された数値の絶対値を返します。

source: Returns the arccosine (the number whose cosine is the specified number) in radians.
ja: アークコサイン（コサインが指定された数値になる数値）をラジアン単位で返します。

source: Returns the arcsine (the number whose sine is the specified number) in radians.
ja: アークサイン（正弦が指定された数値となる数値）をラジアン単位で返します。

source: Returns the arctangent (the number whose tangent is the specified number) in radians.
ja: アークタンジェント（接線が指定した数値となる数値）をラジアン単位で返します。

source: Returns the binary number stored at the specified address+offset.
ja: 指定されたアドレス＋オフセットに格納されている2進数を返します。

source: Returns the class name of a value.
ja: 値のクラス名を返します。

source: Returns the color that is marked transparent in the specified window.
ja: 指定されたウィンドウの中で透明と表示されている色を返します。

source: Returns the column number in an Edit control where the caret (text insertion point) resides.
ja: キャレット（テキスト挿入点）が存在するエディットコントロールのカラム番号を返します。

source: Returns the control names for all controls in the specified window.
ja: 指定されたウィンドウ内のすべてのコントロールのコントロール名を返します。

source: Returns the current capacity of the object's internal array of properties.
ja: オブジェクトの内部配列のプロパティの現在の容量を返します。

source: Returns the current memory address of a string.
ja: 文字列の現在のメモリアドレスを返します。

source: Returns the degree of transparency of the specified window.
ja: 指定されたウィンドウの透明度を返します。

source: Returns the entry number of a ListBox or ComboBox that is a complete match for the specified string.
ja: 指定された文字列と完全に一致するListBoxまたはComboBoxのエントリ番号を返します。

source: Returns the free disk space of the drive which contains the specified path, in megabytes.
ja: 指定されたパスを含むドライブの空きディスク容量をメガバイト単位で返します。

source: Returns the full path and name of the process that owns the specified window.
ja: 指定されたウィンドウを所有するプロセスのフルパスと名前を返します。

source: Returns the function's name.
ja: 関数の名前を返します。

source: Returns the highest value of one or more numbers.
ja: 1つまたは複数の数値のうち、最も大きい値を返します。

source: Returns the index of the currently selected entry or tab in a ListBox, ComboBox or Tab control.
ja: ListBox、ComboBox、Tab コントロールで現在選択されている項目またはタブのインデックスを返します。

source: Returns the length of the overall match or a captured subpattern.
ja: 全体的なマッチの長さ、またはキャプチャしたサブパターンの長さを返します。

source: Returns the line number in an Edit control where the caret (text insert point) resides.
ja: キャレット（テキスト挿入点）が存在するエディットコントロールの行番号を返します。

source: Returns the logarithm (base 10) of a number.
ja: Logarithm関数は、数値の対数（10進数）を返します。

source: Returns the logarithm (base 10) of the specified number.
ja: 指定された数値の対数（10進数）を返します。

source: Returns the lower bound of the nth dimension.
ja: n次元目の下界を返します。

source: Returns the lowest value of one or more numbers.
ja: 1つまたは複数の数値のうち、最も小さい値を返します。

source: Returns the matched item with its original case, which may differ from what the user typed if the C option was omitted.
ja: Cオプションが省略された場合、ユーザーが入力したものと異なる場合がありますが、マッチした項目を元のケースで返します。

source: Returns the media status of the specified CD/DVD drive.
ja: 指定された CD/DVD ドライブのメディアステータスを返します。

source: Returns the name of the end key which was pressed to terminate the Input.
ja: Input を終了させるために押された終了キーの名前を返します。

source: Returns the name of the currently selected entry in a ListBox or ComboBox.
ja: ListBox、ComboBox で現在選択されている項目の名前を返します。

source: Returns the name of the given subpattern, if it has one.
ja: 与えられたサブパターンがある場合、その名前を返します。

source: Returns the name of the process that owns the specified window.
ja: 指定されたウィンドウを所有するプロセスの名前を返します。

source: Returns the name of the specified process.
ja: 指定されたプロセスの名前を返します。

source: Returns the name or path of the specified process.
ja: 指定されたプロセスの名前またはパスを返します。

source: Returns the natural logarithm (base e) of a number.
ja: 自然対数（底e）：数値の自然対数を返します。

source: Returns the natural logarithm (base e) of the specified number.
ja: 指定された数値の自然対数（底e）を返します。

source: Returns the new capacity.
ja: 新しい容量を返します。

source: Returns the number of bytes (not characters) that were written.
ja: 書き込まれたバイト数（文字数ではない）を返します。

source: Returns the number of bytes that were read.
ja: 読み込んだバイト数を返します。

source: Returns the number of bytes that were written.
ja: 書き込まれたバイト数を返します。

source: Returns the number of existing windows that match the specified criteria.
ja: 指定した条件に合致する既存のウィンドウの数を返します。

source: Returns the number of formally-declared parameters for a user-defined function or maximum parameters for a built-in function.
ja: ユーザー定義関数の場合は正式に宣言されたパラメータの数、組み込み関数の場合は最大パラメータ数を返します。

source: Returns the number of lines in an Edit control.
ja: Editコントロールの行数を返します。

source: Returns the number of properties owned by an object.
ja: オブジェクトが所有するプロパティの数を返します。

source: Returns the number of required parameters.
ja: 必要なパラメータの数を返します。

source: Returns the number of rows or columns in the control.
ja: コントロールの行数または列数を返します。

source: Returns the number of the primary monitor.
ja: プライマリモニタの番号を返します。

source: Returns the operating system's name of the specified monitor.
ja: 指定されたモニターのOS上の名前を返します。

source: Returns the ordinal value (numeric character code) of the first character in the specified string.
ja: 指定された文字列の最初の文字の序列値（数値文字コード）を返します。

source: Returns the overall match or a captured subpattern.
ja: 全体的なマッチ、またはキャプチャしたサブパターンを返します。

source: Returns the overall number of subpatterns (capturing groups), which is also the maximum value for N.
ja: Nの最大値でもある、全体のサブパターン（捕獲グループ）数を返す。

source: Returns the path of the specified process.
ja: 指定されたプロセスのパスを返します。

source: Returns the position of the overall match or a captured subpattern.
ja: 全体一致の位置、または取り込んだサブパターンの位置を返します。

source: Returns the process ID (PID) of the process which created the specified process.
ja: 指定されたプロセスを作成したプロセスのプロセスID（PID）を返します。

source: Returns the remainder of a division.
ja: ｂ除算の余りを返します。

source: Returns the remainder of the specified dividend divided by the specified divisor.
ja: 指定された配当金を指定された除数で割った余りを返します。

source: Returns the removed value (blank if none).
ja: 削除された値を返します（ない場合は空白）。

source: Returns the removed value.
ja: 削除された値を返します。

source: Returns the result of raising e (which is approximately 2.71828182845905) to the Nth power.
ja: ネイピア数e（約2.71828182845905）をN乗した結果を返します。

source: Returns the result of raising e to the Nth power.
ja: eをN乗した結果を返します。

source: Returns the row number of the next selected, checked, or focused row, otherwise zero.
ja: 次に選択、チェック、フォーカスされた行の行番号を返し、それ以外の場合は0を返します。

source: Returns the row number of the next selected, checked, or focused row.
ja: 次に選択、チェック、またはフォーカスされた行の行番号を返します。

source: Returns the selected item's ID number.
ja: 選択された項目の ID 番号を返します。

source: Returns the selected text in an Edit control.
ja: Edit コントロールで選択されているテキストを返します。

source: Returns the specified item's parent as an item ID.
ja: 指定された項目の親を項目 ID で返します。

source: Returns the specified number rounded down to the nearest integer (without any .00 suffix).
ja: この関数は、指定された数値を切り捨てて、最も近い整数（接尾辞.00なし）にしたものを返します。

source: Returns the specified number rounded to N decimal places.
ja: 指定された数値を小数点以下N桁で四捨五入した値を返します。

source: Returns the specified number rounded up to the nearest integer (without any .00 suffix).
ja: この関数は、指定された数値を直近の整数に切り上げて返します（接尾辞の .00 は含まれません）。

source: Returns the square root of a number.
ja: 数値の平方根を返します。

source: Returns the square root of the specified number.
ja: 指定された数値の平方根を返します。
